app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "post title"], ["content", "post content"], ["created_at", "2015-07-06 18:25:39.878079"], ["updated_at", "2015-07-06 18:25:39.878079"]]